app/controllers/get_space_controller.rb

SELECT * FROM "locations" WHERE ("locations"."id" = 1)
SELECT * FROM "devices" WHERE ("devices"."deviceID" = '840917e44c4cb037d748044ee0c9897c4589c167') LIMIT 1
INSERT INTO "apn_devices" ("last_registered_at", "created_at", "token", "updated_at", "app_id") VALUES('2010-11-25 00:45:46', '2010-11-25 00:45:46', '64f72aec c502d239 edb9a585 f91fc4f0 ec0b0e7f 18675a12 cc55416d 43af11c3', '2010-11-25 00:45:46', NULL)
INSERT INTO "apn_notifications" ("created_at", "custom_properties", "device_language", "updated_at", "device_id", "sent_at", "badge", "errors_nb", "sound", "alert") VALUES('2010-11-25 00:45:46', NULL, NULL, '2010-11-25 00:45:46', 16, NULL, 5, 0, 't', 'Your space in wanted!')
---
  def get_space
    @location = Location.find(params[:id])
    puts "udid = #{@location.udid}"
    @device = Device.find_by_deviceID(@location.udid)

    puts "deviceToken = "
    pp @device.deviceToken

    device = APN::Device.create(:token => @device.deviceToken)
    notification = APN::Notification.new
    notification.device = device
    notification.badge = 5
    notification.sound = true
    notification.alert = "Your space in wanted!"
    notification.save

UPDATE "locations" SET "updated_at" = '2010-11-20 21:00:44', "status" = 'U' WHERE "id" = 2022631669
---



     @location.update_attribute(:status,"U")