app/controllers/locations_controller.rb

  def index
    puts "latitude = #{params[:latitude]}"
    puts "longitude = #{params[:longitude]}"
    puts "userid = #{params[:userid]}"

    lat_range = get_range(params[:latitude])
    long_range = get_range(params[:longitude])
    userid = params[:userid]

    puts "latitude range = #{lat_range}"
    puts "longitude range = #{long_range}"
    #@locations = Location.all
    @locations = Location.find(:all, :conditions => { :latitude_gt => lat_range[0], :latitude_lt => lat_range[1], :longitude_gt => long_range[0], :longitude_lt => long_range[1], :userid_ne => userid})
---
SELECT * FROM "locations" WHERE ("locations"."userid" != 'swhirsch' AND "locations"."latitude" > 40.654205 AND "locations"."latitude" < 40.754205 AND "locations"."longitude" > -73.886105 AND "locations"."longitude" < -73.786105 )

  def show
    @location = Location.find(params[:id])
---
SELECT * FROM "locations" WHERE ("locations"."id" = 1)

  def edit
    @location = Location.find(params[:id])
---
SELECT * FROM "locations" WHERE ("locations"."id" = 1906825934)

  def create
    @location = Location.new(params[:location])

    respond_to do |format|
      if @location.save
---
INSERT INTO "locations" ("userid", "latitude", "longitude", "created_at", "updated_at", "status", "points", "udid") VALUES('fuckface ', 40.702999, -73.834999, '2009-12-26 22:42:50', '2009-12-26 22:42:50', NULL, NULL, '840917e44c4cb037d748044ee0c9897c4589c167')

  def update
    @location = Location.find(params[:id])

    respond_to do |format|
      if @location.update_attributes(params[:location])
---
SELECT * FROM "locations" WHERE ("locations"."id" = 183)
UPDATE "locations" SET "latitude" = 40.701073, "longitude" = -73.833843, "udid" = '1130952b3dfc82108492a4735e226daaa7b0e649', "status" = '(null)', "updated_at" = '2010-02-12 01:36:22' WHERE "id" = 2022631636

  def destroy
    @location = Location.find(params[:id])
    @location.destroy
---
SELECT * FROM "locations" WHERE ("locations"."id" = 9)
DELETE FROM "locations" WHERE "id" = 9