app/controllers/user_controller.rb

  def index
     puts "userid = #{params[:userid]}"

     userid = params[:userid]
    @user = Location.find(:all, :conditions => { :userid_eq => userid })
---
SELECT * FROM "locations" WHERE ("locations"."userid" = 'swhirsch' )